PinkFluffyUnic0rn/stm32flight/main.c
/**
* @file main.c
* @brief Main file with entry point
*/

#include <math.h>
#include <string.h>
#include <stdio.h>
#include <stdarg.h>
#include <stdlib.h>
#include <ctype.h>

#include "mcudef.h"

#include "periphconf.h"
#include "settings.h"
#include "dsp.h"
#include "log.h"
#include "controlloop.h"
#include "crc.h"
#include "runvals.h"
#include "timev.h"
#include "command.h"
#include "config.h"
#include "util.h"

#include "device.h"
#include "icm42688.h"
#include "dps368.h"
#include "esp8266.h"
#include "qmc5883l.h"
#include "crsf.h"
#include "w25.h"
#include "m10.h"
#include "uartconf.h"
#include "irc.h"
#include "msp.h"
#include "dshot.h"

/**
* @brief External interrupt callback. It calls interrupt handlers
	from drivers for devices that use external interrupts.
* @param pin number of pin triggered the callback
* @return none
*/
void HAL_GPIO_EXTI_Callback(uint16_t pin)
{
	if (DEVITENABLED(Dev[DEV_RF].status)) {
		Dev[DEV_RF].interrupt(Dev[DEV_RF].priv, &pin);
	}
}

/**
* @brief UART receive callback. It calls interrupt handlers
	from drivers for devices working through UART.
* @param huart context for UART triggered that callback
* @return none
*/
void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart)
{
	if (DEVITENABLED(Dev[DEV_GNSS].status))
		Dev[DEV_GNSS].interrupt(Dev[DEV_GNSS].priv, huart);

	if (DEVITENABLED(Dev[DEV_CRSF].status))
		Dev[DEV_CRSF].interrupt(Dev[DEV_CRSF].priv, huart);

	if (DEVITENABLED(Dev[DEV_VTX].status))
		Dev[DEV_VTX].interrupt(Dev[DEV_VTX].priv, huart);

	if (DEVITENABLED(Dev[DEV_UART].status))
		Dev[DEV_UART].interrupt(Dev[DEV_UART].priv, huart);
}

/**
* @brief SPI transmit callback. It calls interrupt handlers
	from drivers for devices working through SPI.
* @param hspi context for SPI triggered that callback
* @return none
*/
void HAL_SPI_TxCpltCallback(SPI_HandleTypeDef *hspi)
{
	if (DEVITENABLED(Flashdev.status))
		Flashdev.interrupt(Flashdev.priv, hspi);
}

/**
* @brief UART error callback. Calls UART error handlers
	from drivers for devices working through UART.
* @param huart context for UART triggered that callback.
* @return none
*/
void HAL_UART_ErrorCallback(UART_HandleTypeDef *huart)
{
	if (DEVITENABLED(Dev[DEV_CRSF].status))
		Dev[DEV_CRSF].error(Dev[DEV_CRSF].priv, huart);

	if (DEVITENABLED(Dev[DEV_VTX].status))
		Dev[DEV_VTX].error(Dev[DEV_VTX].priv, huart);
}

/**
* @brief Non-maskable interrupt handler.
* @return none
*/
void NMI_Handler(void)
{
	TIM1->CCR1 = TIM1->CCR2 = TIM1->CCR3 = TIM1->CCR4 = 0;

	HAL_GPIO_WritePin(ERROR_GPIO, ERROR_PIN, GPIO_PIN_SET);

	while (1) {}
}

/**
* @brief Hard-fault interrupt handler.
* @return none
*/
void HardFault_Handler(void)
{
	TIM1->CCR1 = TIM1->CCR2 = TIM1->CCR3 = TIM1->CCR4 = 0;

	HAL_GPIO_WritePin(ERROR_GPIO, ERROR_PIN, GPIO_PIN_SET);
	
	while (1) {}
}

/**
* @brief Memory management error interrupt handler.
* @return none
*/
void MemManage_Handler(void)
{
	TIM1->CCR1 = TIM1->CCR2 = TIM1->CCR3 = TIM1->CCR4 = 0;
	
	HAL_GPIO_WritePin(ERROR_GPIO, ERROR_PIN, GPIO_PIN_SET);

	while (1) {}
}

/**
* @brief Bus fault error interrupt handler.
* @return none
*/
void BusFault_Handler(void)
{
	TIM1->CCR1 = TIM1->CCR2 = TIM1->CCR3 = TIM1->CCR4 = 0;
	
	HAL_GPIO_WritePin(ERROR_GPIO, ERROR_PIN, GPIO_PIN_SET);
	
	while (1) {}
}

/**
* @brief Usage fault error interrupt handler.
* @return none
*/
void UsageFault_Handler(void)
{
	TIM1->CCR1 = TIM1->CCR2 = TIM1->CCR3 = TIM1->CCR4 = 0;
	
	HAL_GPIO_WritePin(ERROR_GPIO, ERROR_PIN, GPIO_PIN_SET);

	while (1) {}
}

/**
* @brief HAL error handler.
* @return none
*/
void error_handler(void)
{
	TIM1->CCR1 = TIM1->CCR2 = TIM1->CCR3 = TIM1->CCR4 = 0;

	HAL_GPIO_WritePin(ERROR_GPIO, ERROR_PIN, GPIO_PIN_SET);

	__disable_irq();
	while (1) {}
}

/**
* @brief Get ADC sampled value.
* @param hadc ADC handle
* @param buf write buffer for DMA
* @return samlped value
*/
double adcvalue(ADC_HandleTypeDef *hadc, volatile uint16_t *buf)
{
	uint32_t v;
	int t;

	t = 0;
	while ((HAL_ADC_GetState(hadc) & HAL_ADC_STATE_REG_BUSY) != 0
			&& t < 100000) {
		udelay(10);
		t += 10;
	}

	v = *buf;

	HAL_ADC_Start_DMA(hadc, (uint32_t *) buf, 1);

	return v;
}

/**
* @brief Get battery voltage from ADC.
* @return battery voltage
*/
double batteryvoltage()
{
	ADC_HandleTypeDef *hadc;
	static volatile uint16_t buf = 0;

	hadc = pconf_batteryhadc;

	return (adcvalue(hadc, &buf)
		/ (double) 0xfff * BAT_SCALE * St.adj.batsc);
}

/**
* @brief Get ESC current from ADC.
* @return battery current in amperes
*/
double esccurrent()
{
	ADC_HandleTypeDef *hadc;
	static volatile uint16_t buf = 0;
	
	hadc = pconf_currenthadc;

	return (adcvalue(hadc, &buf)
		/ (double) 0xfff * St.adj.current.scale
		+ St.adj.current.offset);

}

int imuupdate(int ms)
{
	double gx, gy, gz;
	double vcoef, thr, frq;

	// get accelerometer and gyroscope readings
	Dev[DEV_IMU].read(Dev[DEV_IMU].priv, &Imudata,
		sizeof(struct imu_data));

	// apply accelerometer offsets
	Imudata.afx += (Imudata.ft - 25.0) * St.adj.acctsc.x;
	Imudata.afy += (Imudata.ft - 25.0) * St.adj.acctsc.y;
	Imudata.afz += (Imudata.ft - 25.0) * St.adj.acctsc.z;

	Imudata.afx += St.adj.acc0.x;
	Imudata.afy += St.adj.acc0.y;
	Imudata.afz += St.adj.acc0.z;

	// apply gyroscope offsets
	Imudata.gfx += St.adj.gyro0.x;
	Imudata.gfy += St.adj.gyro0.y;
	Imudata.gfz += St.adj.gyro0.z;

	// write accelerometer and gyroscope values into log
	writelog(LOG_ACC_X, Imudata.afx);
	writelog(LOG_ACC_Y, Imudata.afy);
	writelog(LOG_ACC_Z, Imudata.afz);
	writelog(LOG_GYRO_X, Imudata.gfx);
	writelog(LOG_GYRO_Y, Imudata.gfy);
	writelog(LOG_GYRO_Z, Imudata.gfz);

	// calculate frequency for gyroscope notch filter	
	vcoef = dsp_getlpf(Lpf + LPF_BAT) / St.notch.gyrovbat;
	thr = dsp_getlpf(Lpf + LPF_AVGTHR) * vcoef * vcoef;

	frq = St.notch.gyrofrmin + thr * thr
		* (St.notch.gyrofrmax - St.notch.gyrofrmin);
	
	// update notch filter's coefficients	
	dsp_setnotch2(&Flt, frq, 300.0, PID_FREQ, 0);
	
	// update notch filter
	dsp_updatefilterv(&Flt, Imudata.gfx, Imudata.gfy, Imudata.gfz,
		&gx, &gy, &gz);

	// update accelerometer values
	dsp_updatelpf(Lpf + LPF_ACCX, Imudata.afx);
	dsp_updatelpf(Lpf + LPF_ACCY, Imudata.afy);
	dsp_updatelpf(Lpf + LPF_ACCZ, Imudata.afz);

	// update gyroscope values
	dsp_updatelpf(Lpf + LPF_GYROX, gx);
	dsp_updatelpf(Lpf + LPF_GYROY, gy);
	dsp_updatelpf(Lpf + LPF_GYROZ, gz);

	// update accelerometer temperature
	dsp_updatelpf(Lpf + LPF_IMUTEMP, Imudata.ft);

